---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLevelInfo.GetLocalPlacement
source: html/92ba4abe-f0c9-d226-ea8d-5c660cfeb377.htm
---
# Autodesk.Revit.DB.IFC.IFCLevelInfo.GetLocalPlacement Method

Gets the local placement.

## Syntax (C#)
```csharp
public IFCAnyHandle GetLocalPlacement()
```

## Returns
The local placement.